%---------系统辨识大作业----------------------------------------
%自动化1605 韩祖成 1605010409
%---------系统辨识大作业----------------------------------------
%最小二乘法迭代实现的结果
%设置时变参数
%使用之前清空工作区
num=zeros(800,3);
for i=1:800
    num(i,2)=0.8+i/800;  %;构建b1值从0.8变化为1.2
    num(i,3)=0.4+i/800;  %构建b2值从0.4变化为0.8
end
num(400:800,2)=1.2;
num(400:800,3)=0.8;
b1=num(:,2);b2=num(:,3);
a1=-1.5;a2=0.7;
%设置M序列
L=800; % M序列的长度
y1=1;y2=1;y3=1;y4=1;%4个移位积存器的输出初始值
for i=1:700 %开始循环，长度为L
    x1=xor(y3,y4);
    x2=y1; x3=y2; x4=y3; y(i)=y4;
    if y(i)>0.5
        U(i)=1; %如果M序列的值为"1"时,%辨识的输入信号取“-1”
    else
        U(i)=0; %当M序列的值为"0"时.辨识的输入信号取“1”
    end
    y1=x1;y2=x2;y3=x3;y4=x4; %为下一次的输入信号做准备
end %大循环结束，产生输入信号u
Y(2)=0;Y(1)=0; %取Y的前两个初始值为零
for k=3:700
Y(k)=-a1*Y(k-1)-a2*Y(k-2)+b1(k)*U(k-1)+b2(k)*U(k-2);
end
UY=[U' Y'];
L=680;
%---------RLS递推最小二乘辨识----------------------------------------
c0=[0.001 0.001 0.001 0.001]'; %直接给出被辨识参数的初始值,
%即一个充分小的实向量
p0=10^6*eye(4); %直接给出初始状态P0，
%即一个充分大的实数单位矩阵
%E=0.000000005; %相对误差E=0.000000005
c=[c0,zeros(4,L)]; %被辨识参数矩阵的初始值
e=zeros(4,L); %相对误差的初始值及大小
z(1:L)=UY(1:L,2);
u(1:L)=UY(1:L,1);
for k=3:L %开始求K
   h1=[-z(k-1),-z(k-2),u(k-1),u(k-2)]';
    x=h1'*p0*h1+1; 
    x1=inv(x);
k1=p0*h1*x1; %求出K的值
d1=z(k)-h1'*c0; c1=c0+k1*d1; %求被辨识参数c
e1=c1-c0; %求参数当前值与上一次的值的差值
e2=e1./c0; %求参数的相对变化
e(:,k)=e2; %把当前相对变化的列向量加入误差矩阵的最后一列
c0=c1; %新获得的参数作为下一次递推的旧参数
c(:,k)=c1; %把辨识参数c 列向量加入辨识参数矩阵的最后一列
p1=p0-k1*k1'*[h1'*p0*h1+1]; %求出p(k)的s值
p0=p1; %给下次用
%if e2<=E break; %若参数收敛满足要求，终止计算
end
%end
c(:,L),e(:,L) %显示被辨识参数,显示辨识结果的收敛情况
% %------分离参数-------------------------------------------------------------
 a1=c(1,1:L); a2=c(2,1:L); b1=c(3,1:L); b2=c(4,1:L);
ea1=e(1,1:L); ea2=e(2,1:L); eb1=e(3,1:L); eb2=e(4,1:L);
% %------画图-------------------------------------------------------------------
%画出a1，a2，b1，b2的各次辨识结果
figure(2);i=1:L; plot(i,a1,'r',i,a2,'y',i,b1,'g.',i,b2,'b-')
legend('a1','a2','b1','b2'); 
title('a1，a2，b1，b2的各次辨识结果')
%画出a1，a2，b1，b2的各次辨识结果的收敛情况
figure(3); i=1:L; plot(i,ea1,'r',i,ea2,'g',i,eb1,'b',i,eb2,'r:')
title('辨识结果的收敛情况')
%--------------------------------------------------------------------------------
