%---------系统辨识大作业----------------------------------------
%自动化1605 韩祖成 1605010409
%---------系统辨识大作业----------------------------------------
% 相关分析法获得脉冲响应序列
N = 2^4-1;
deta = 2;  %deta为脉冲的周期
a = 5;  %a为脉冲正输出值
M = zeros(N,N);  
for i=1:1:N
    for j=1:1:N
        M(i,j) = UY(N-i+j,1); %给矩阵M赋值
    end
end
Y = zeros(N,1);
for i=1:1:N
    Y(i,1)=UY(N+i-1,2); %给矩阵Y赋值
end
R = ones(N,N);
for i = 1:1:N
    R(i,i) = 2;     %给矩阵Rym赋值
end
G = (1/(a*a*(N+1)*deta))*R*M*Y;  %这是相关分析法辨识脉冲响应的最重要公式
t = 0:2:28;  %由于周期为2，故按2进位    
plot(t',G,'b*');   %绘制响应曲线
hold on
L=15;N=15;
Yy=UY(N:L+N-1,2)/2;
for i=1:L
    Hl(i,:)=UY(N+i-1:-1:i,1);
end
GG=inv(Hl'*Hl)*Hl'*Yy;  %ppt上的公式存在错误，重新推导以后将其修改
% GG=GG./10^5;
 plot(0:2:28,GG,'r--')
title('相关分析法和最小二乘法获得脉冲序列');
