%---------系统辨识大作业----------------------------------------
%自动化1605 韩祖成 1605010409
%---------系统辨识大作业----------------------------------------
%带遗忘因子的最小二乘法
%设置时变参数
%使用之前清空工作区
num=zeros(800,3);
for i=1:800
    num(i,2)=0.8+i/1000;  %;构建b1值从0.8变化为1.2
    num(i,3)=0.4+i/1000;  %构建b2值从0.4变化为0.8
end
num(400:800,2)=1.2;
num(400:800,3)=0.8;
b1=num(:,2);b2=num(:,3);
a1=-1.5;a2=0.7;
%设置M序列
L=800; % M序列的长度
y1=1;y2=1;y3=1;y4=1;%4个移位积存器的输出初始值
for i=1:L %开始循环，长度为L
    x1=xor(y3,y4);
    x2=y1; x3=y2; x4=y3; y(i)=y4;
    if y(i)>0.5
        U(i)=1; %如果M序列的值为"1"时,%辨识的输入信号取“-1”
    else
        U(i)=0; %当M序列的值为"0"时.辨识的输入信号取“1”
    end
    y1=x1;y2=x2;y3=x3;y4=x4; %为下一次的输入信号做准备
end %大循环结束，产生输入信号u
Y(2)=0;Y(1)=0; %取Y的前两个初始值为零
for k=3:800
Y(k)=-a1*Y(k-1)-a2*Y(k-2)+b1(k)*U(k-1)+b2(k)*U(k-2);
end
UY=[U' Y'];
%带遗忘因子的最小二乘法
na=2; nb=2;d=0;     
L=700;u=0.95;    %u为遗忘因子  
uk=UY(1:L,1)';     
yk=UY(1:L,2)';     
thetae_1=zeros(na+nb,1);   
P=10^6*eye(na+nb); 
for k=3:L   %采用迭代的方式进行推导计算
phi=[-yk((k-1):-1:(k-2)) uk((k-1):-1:(k-2))];	    K=P*phi'/(u+phi*P*phi');
    thetae(:,k)=thetae_1+K*(yk(k)-phi*thetae_1);
    P=(eye(na+nb)-K*phi)*P/u; 
    thetae_1=thetae(:,k);
    for i=d+nb:-1:2
        uk(i)=uk(i-1);
    end  
    for i=na:-1:2
        yk(i)=yk(i-1);
    end
end
plot([1:L],thetae);
theta = thetae(:,700)
legend('a1','a2','b1','b2'); 
title('带遗忘因子的最小二乘法辨识参数')
